Revit 2024 API
WallSweepInfo.IsCutByInserts Property
 Indicates if the sweep is cut by wall inserts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsCutByInserts { get; set; }
Visual Basic
Public Property IsCutByInserts As Boolean
	Get
	Set
Visual C++
public:
property bool IsCutByInserts {
	bool get ();
	void set (bool value);
}
Field Value
 True if the sweep is cut by wall inserts, false otherwise.
See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace